code-review/NRB_3471_3546/База_Было/DataProcessors/СверкаПоСтатикеЦБв1СиBQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СверкаПоСтатикеЦБв1СиBQ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокЦБДляСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКодаДляСверки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКодовДляСверкиСтатикиЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДляСверки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AssetID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьРасхождения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/СверкаПоСтатикеЦБв1СиBQ/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлементовПриНевыполненнойСверке(Элементы);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СписокВыбора = Элементы.ИмяРеквизита.СписокВыбора;
	СоответствиеИменРеквизитовЦБ = ОбработкаОбъект.СоответствиеИменОсновныхРеквизитовЦБ();
	ДобавитьОтсортированныеЗначениеВСписокВыбора(СписокВыбора, СоответствиеИменРеквизитовЦБ, "ЦБ: ");
	СписокВыбора.Добавить("ЦБ: Эмитент");
	СоответствиеИменРеквизитовЭмитента = ОбработкаОбъект.СоответствиеИменОсновныхРеквизитовЭмитента();
	ДобавитьОтсортированныеЗначениеВСписокВыбора(СписокВыбора, СоответствиеИменРеквизитовЭмитента, "Эмитент: ");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоОдномуРеквизитуПриИзменении(Элемент)
	Элементы.ИмяРеквизита.Доступность = ПоОдномуРеквизиту;
КонецПроцедуры

&НаКлиенте
Процедура СписокЦБДляСверкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.СписокЦБДляСверкиОшибки И Элемент <> Неопределено Тогда
		ТекСтрока = Объект.СписокЦБДляСверки.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", "Ошибки при сверке по ЦБ """ + Строка(ТекСтрока.ЦеннаяБумага) + """");
		ПараметрыФормы.Вставить("Текст", ТекСтрока.Ошибки);
		ОткрытьФорму("ОбщаяФорма.ПоказТекста", ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЦБДляСверкиЦеннаяБумагаПриИзменении(Элемент)
	ИдентификаторТекСтроки = Элементы.СписокЦБДляСверки.ТекущаяСтрока;
	ТекСтрока = Объект.СписокЦБДляСверки.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	ДанныеОКоде = РаботаСДаннымиBQВызовСервера.ТипКодаИКодДляСверки(ТекСтрока.ЦеннаяБумага);
	ТекСтрока.ТипКодаДляСверки = ДанныеОКоде.ТипКода;
	ТекСтрока.КодДляСверки = ДанныеОКоде.Код;
	ТекСтрока.ЕстьРасхождения = Ложь;
	ТекСтрока.Ошибки = "";
	УстановитьСостояниеСверкаНеВыполнена();
КонецПроцедуры

&НаКлиенте
Процедура СписокЦБДляСверкиТипКодаДляСверкиПриИзменении(Элемент)
	ИдентификаторТекСтроки = Элементы.СписокЦБДляСверки.ТекущаяСтрока;
	ТекСтрока = Объект.СписокЦБДляСверки.НайтиПоИдентификатору(ИдентификаторТекСтроки);
	ТекСтрока.КодДляСверки = РаботаСДаннымиBQВызовСервера.КодЦБЗаданногоТипа(ТекСтрока.ЦеннаяБумага, ТекСтрока.ТипКодаДляСверки);
	ТекСтрока.ЕстьРасхождения = Ложь;
	ТекСтрока.Ошибки = "";
	УстановитьСостояниеСверкаНеВыполнена();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьСверку(Команда)
	УстановитьСостояниеСверкаНеВыполнена();
	ВыполнитьСверкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	Объект.СписокЦБДляСверки.Добавить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокЦБДляСверки(Команда)
	Объект.СписокЦБДляСверки.Очистить();
	УстановитьВидимостьЭлементовПриНевыполненнойСверке(Элементы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокЦБДляСверки(Команда)
	Объект.СписокЦБДляСверки.Очистить();
	УстановитьВидимостьЭлементовПриНевыполненнойСверке(Элементы);
	ЗаполнитьСписокЦБДляСверкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЖурналИсходящихСообщенийKafka(Команда)
	ОткрытьФорму("РегистрСведений.ЖурналИсходящихСообщенийKafka.ФормаСписка");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьСостояниеСверкаНеВыполнена()
	Если Элементы.СписокЦБДляСверкиЕстьРасхождения.Видимость Тогда
		Для Каждого СтрокаТЧ Из Объект.СписокЦБДляСверки Цикл
			СтрокаТЧ.Ошибки = "";
			СтрокаТЧ.ЕстьРасхождения = Ложь;
		КонецЦикла;
		УстановитьВидимостьЭлементовПриНевыполненнойСверке(Элементы);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовПриНевыполненнойСверке(Элементы)
	Элементы.СтраницаРасхожденияНайденныеПриСверке.Видимость = Ложь;
	Элементы.СписокЦБДляСверкиЕстьРасхождения.Видимость = Ложь;
	Элементы.СписокЦБДляСверкиОшибки.Видимость = Ложь;
	Элементы.СписокЦБДляСверкиAssetID.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСверкуНаСервере()
	ВремяНачала = ТекущаяДатаСеанса();
	
	Если Объект.СписокЦБДляСверки.Количество() = 0 Тогда
		ЗаполнитьСписокЦБДляСверкиНаСервере();
	КонецЕсли;
	
	Если СписокЦБДляСверкиЗаполненКорректно() Тогда
		ТабДокРезультат.Очистить();
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		Если ПоОдномуРеквизиту И НЕ ПустаяСтрока(ИмяРеквизита) Тогда
			ТабДокРезультат = ОбработкаОбъект.РезультатСверкиДанных(ИмяРеквизита);
		Иначе
			ТабДокРезультат = ОбработкаОбъект.РезультатСверкиДанных();
		КонецЕсли;
		
		НайденыРасхождения = ОбработкаОбъект.НайденыРасхождения();
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
		
		Элементы.СписокЦБДляСверкиЕстьРасхождения.Видимость = Истина;
		Элементы.СписокЦБДляСверкиОшибки.Видимость = Истина;
		Элементы.СписокЦБДляСверкиAssetID.Видимость = Истина;
		Элементы.СтраницаРасхожденияНайденныеПриСверке.Видимость = НайденыРасхождения;
		
		ВремяКонца = ТекущаяДатаСеанса();
		ПродолжительностьВыполнения = ВремяКонца - ВремяНачала;
		Текст = "Сверка статики ЦБ с BQ заняла " + Строка(ПродолжительностьВыполнения) + " сек.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СписокЦБДляСверкиЗаполненКорректно()
	Отказ = Ложь;
	
	Для Каждого СтрокаТЧ Из Объект.СписокЦБДляСверки Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ЦеннаяБумага) Тогда
			Текст = "Не указана ценная бумага в строке " + Строка(СтрокаТЧ.НомерСтроки);
			Поле = "СписокЦБДляСверки[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ЦеннаяБумага";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , Поле, "Объект", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ТипКодаДляСверки) Тогда
			Текст = "Не указан тип кода ценной бумаги в строке " + Строка(СтрокаТЧ.НомерСтроки);
			Поле = "СписокЦБДляСверки[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ТипКодаДляСверки";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , Поле, "Объект", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.КодДляСверки) Тогда
			Текст = "Не указан код ценной бумаги в строке " + Строка(СтрокаТЧ.НомерСтроки);
			Поле = "СписокЦБДляСверки[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].КодДляСверки";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат (Не Отказ);
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЦБДляСверкиНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьСписокЦБ();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьМетодРегламентногоЗадания(Команда)
	РегламентныеЗаданияСервер.СверкаСтатикиЦБ_ДЕПО_BQ();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокЦБИзExcel(Команда)
	РаботаСДиалогамиКлиент.ЗагрузитьВТабличнуюЧастьСписокЦБИзExcel(Объект.СписокЦБДляСверки, "ЦеннаяБумага", ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтсортированныеЗначениеВСписокВыбора(СписокВыбора, СоответствиеИменРеквизитов, Префикс)
	Реквизиты = Новый СписокЗначений;
	Для Каждого Элемент Из СоответствиеИменРеквизитов Цикл
		Реквизиты.Добавить(Элемент.Ключ);
	КонецЦикла;
	Реквизиты.СортироватьПоЗначению();
	Для Каждого Элемент Из Реквизиты Цикл
		СписокВыбора.Добавить(Префикс + Элемент.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
